Tekla Open API Reference for Tekla Structures 2025
AnalysisModelSpectrumProperties.SpectrumMissingMassEnable Property
 Indicates whether the missing mass of the spectrum is enabled.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SpectrumMissingMassEnable { get; set; }
Public Property SpectrumMissingMassEnable As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisModelSpectrumProperties Class
Tekla.Structures.Analysis Namespace